Revit.Elements.ReferencePlane
A Revit ReferencePlane

Revit.Elements.ReferencePlane.#ctor(Autodesk.Revit.DB.ReferencePlane)
Internal reference plane
referencePlane:

Revit.Elements.ReferencePlane.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.View)
Constructor used internally by public static constructors
bubbleEnd:
freeEnd:
normal:
view:

Revit.Elements.ReferencePlane.InitReferencePlane(Autodesk.Revit.DB.ReferencePlane)
Initialize a ReferencePlane element
referencePlane:

Revit.Elements.ReferencePlane.InitReferencePlane(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.View)
Initialize a ReferencePlane element
bubbleEnd:
freeEnd:
normal:
view:

Revit.Elements.ReferencePlane.InternalSetReferencePlane(Autodesk.Revit.DB.ReferencePlane)
Set the InternalReferencePlane and update the element id and unique id
rp:

Revit.Elements.ReferencePlane.InternalSetEndpoints(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Mutate the two end points of the ReferencePlane
bubbleEnd:
freeEnd:
Returns: False if the operation failed

Revit.Elements.ReferencePlane.ByLine(Autodesk.DesignScript.Geometry.Line)
Form a ReferencePlane from a line in the Active view.  The cut vector is the Z Axis.
line: The line where the bubble wil be located at the start
Returns:

Revit.Elements.ReferencePlane.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Form a Refernece plane from two end points in the Active view.  The cut vector is the Z Axis.
start: The location where the bubble will be located
end: The other end
Returns:

Revit.Elements.ReferencePlane.InternalReferencePlane
Internal handle for the Revit object

Revit.Elements.ReferencePlane.InternalElement
Reference to the Element

Revit.Elements.ReferencePlane.Plane
Get the internal Geometric Plane

Revit.Elements.ReferencePlane.ElementPlaneReference
Get a reference to this plane for downstream Elements requiring it